aesni/aesni-fio.out
aesni-write: (g=0): rw=randwrite, bs=16K-16K/16K-16K, ioengine=libaio, iodepth=2
aesni-read: (g=0): rw=randread, bs=16K-16K/16K-16K, ioengine=libaio, iodepth=2
fio 2.0.3
Starting 2 processes

aesni-write: (groupid=0, jobs=1): err= 0: pid=4977
  write: io=360032KB, bw=1200.2KB/s, iops=75 , runt=300002msec
    slat (usec): min=23 , max=10632 , avg=38.09, stdev=70.77
    clat (usec): min=406 , max=39265 , avg=1194.84, stdev=1778.96
     lat (usec): min=445 , max=39302 , avg=1234.43, stdev=1781.49
    clat percentiles (usec):
     |  1.00th=[  422],  5.00th=[  438], 10.00th=[  454], 20.00th=[  458],
     | 30.00th=[  462], 40.00th=[  466], 50.00th=[  466], 60.00th=[  470],
     | 70.00th=[  482], 80.00th=[  972], 90.00th=[ 3696], 95.00th=[ 5600],
     | 99.00th=[ 8160], 99.50th=[ 9152], 99.90th=[10816]
    bw (KB/s)  : min= 1179, max= 1262, per=100.00%, avg=1200.84, stdev= 9.00
    lat (usec) : 500=73.49%, 750=4.20%, 1000=2.92%
    lat (msec) : 2=3.86%, 4=6.41%, 10=8.88%, 20=0.23%, 50=0.01%
  cpu          : usr=0.01%, sys=1.03%, ctx=45134, majf=0, minf=32
  IO depths    : 1=99.9%, 2=0.1%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=22502/d=0, short=r=0/w=0/d=0
aesni-read: (groupid=0, jobs=1): err= 0: pid=4978
  read : io=120032KB, bw=409683 B/s, iops=25 , runt=300019msec
    slat (usec): min=17 , max=140 , avg=28.40, stdev= 2.40
    clat (usec): min=399 , max=41465 , avg=7943.31, stdev=3559.36
     lat (usec): min=427 , max=41493 , avg=7973.19, stdev=3559.19
    clat percentiles (usec):
     |  1.00th=[  418],  5.00th=[ 2736], 10.00th=[ 3504], 20.00th=[ 4768],
     | 30.00th=[ 5856], 40.00th=[ 6944], 50.00th=[ 7840], 60.00th=[ 8768],
     | 70.00th=[ 9664], 80.00th=[10560], 90.00th=[12480], 95.00th=[14144],
     | 99.00th=[17280], 99.50th=[18304], 99.90th=[21632]
    bw (KB/s)  : min=  384, max=  448, per=100.00%, avg=400.07, stdev= 5.37
    lat (usec) : 500=1.91%, 750=0.04%
    lat (msec) : 2=0.36%, 4=11.46%, 10=59.96%, 20=26.03%, 50=0.24%
  cpu          : usr=0.00%, sys=0.35%, ctx=15007, majf=0, minf=41
  IO depths    : 1=99.9%, 2=0.1%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=7502/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=120032KB, aggrb=400KB/s, minb=409KB/s, maxb=409KB/s, mint=300019msec, maxt=300019msec
  WRITE: io=360032KB, aggrb=1200KB/s, minb=1228KB/s, maxb=1228KB/s, mint=300002msec, maxt=300002msec

Disk stats (read/write):
  xvdd: ios=7498/22610, merge=0/59, ticks=60086/33583, in_queue=93669, util=24.55%